spec/support/mvi/find_candidate_response.xml

<env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
              xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Header/>
  <env:Body>
    <idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"
                           xmlns="urn:hl7-org:v3" xmlns:idm="http://vaww.oed.oit.va.gov">
      <id extension="WSDOC1609020841183530969945627" root="2.16.840.1.113883.4.349"/>
      <creationTime value="20160902084118"/>
      <versionCode code="3.0"/>
      <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
      <processingCode code="T"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <receiver typeCode="RCV">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200M" root="2.16.840.1.113883.4.349"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id extension="MCID-12345" root="1.2.840.114350.1.13.0.1.7.1.1"/>
        </targetMessage>
      </acknowledgement>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/>
        <subject typeCode="SUBJ">
          <registrationEvent classCode="REG" moodCode="EVN">
            <id nullFlavor="NA"/>
            <statusCode code="active"/>
            <subject1 typeCode="SBJ">
              <patient classCode="PAT">
                <id extension="1001169715V310932^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/>
                <id extension="76143^PI^516^USVHA^PCE" root="2.16.840.1.113883.4.349"/>
                <id extension="2^PI^553^USVHA^PCE" root="2.16.840.1.113883.4.349"/>
                <id extension="2^PI^500^USVHA^PCE" root="2.16.840.1.113883.4.349"/>
                <id extension="93838^PI^200HD^USVHA^A" root="2.16.840.1.113883.4.349"/>
                <id extension="TKIP406281^PI^200IP^USVHA^A" root="2.16.840.1.113883.4.349"/>
                <id extension="7172149^PI^608^USVHA^A" root="2.16.840.1.113883.4.349"/>
                <statusCode code="active"/>
                <patientPerson>
                  <name use="L">
                    <given>MICHAEL</given>
                    <given>JAMES</given>
                    <family>KILMADE</family>
                    <prefix>MR</prefix>
                    <suffix>SR</suffix>
                  </name>
                  <name use="P">
                    <delimiter>101</delimiter>
                    <family>ZACHARY</family>
                  </name>
                  <name use="C">
                    <family>SMITH</family>
                  </name>
                  <administrativeGenderCode code="M"/>
                  <birthTime value="19420415"/>
                  <multipleBirthInd value="true"/>
                  <asOtherIDs classCode="SSN">
                    <id extension="350471102" root="2.16.840.1.113883.4.1"/>
                    <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                      <id root="1.2.840.114350.1.13.99997.2.3412"/>
                    </scopingOrganization>
                  </asOtherIDs>
                  <birthPlace>
                    <addr>
                      <city>JOHNSON CITY</city>
                      <state>MS</state>
                      <country>USA</country>
                    </addr>
                  </birthPlace>
                </patientPerson>
                <subjectOf1>
                  <queryMatchObservation classCode="COND" moodCode="EVN">
                    <code code="IHE_PDQ"/>
                    <value nullFlavor="NA" xsi:type="INT"/>
                  </queryMatchObservation>
                </subjectOf1>
              </patient>
            </subject1>
            <custodian typeCode="CST">
              <assignedEntity classCode="ASSIGNED">
                <id root="2.16.840.1.113883.4.349"/>
              </assignedEntity>
            </custodian>
          </registrationEvent>
        </subject>
        <queryAck>
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <queryResponseCode code="OK"/>
          <resultCurrentQuantity value="1"/>
        </queryAck>
        <queryByParameter>
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <statusCode code="new"/>
          <modifyCode code="MVI.COMP1"/>
          <initialQuantity value="1"/>
          <parameterList>
            <id extension="1001169715V310932^NI" root="2.16.840.1.113883.4.349"/>
          </parameterList>
        </queryByParameter>
      </controlActProcess>
    </idm:PRPA_IN201306UV02>
  </env:Body>
</env:Envelope>
